<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"ef4455fc06100484c9329fbe3fb7c132cc23a6055282a6299b2d60c94eb7aaac","plan_job_ref":"Job Test actions using target and replace #438 at https://github.com/dflook/terraform-github-actions/actions/runs/12449907040","plan_out_hash":"0fe3b6dec324821b994202886db0851a2d4a8cb977ebcc3f3402087793d70b21","plan_hash":"839f67bc393a7e6856fba2476057ca18f77f0c9cb16daadba44a7c15b4eface8","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "fS02hHcwJN" -> (known after apply)
!~  foreach = "xWa0OOqZra" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #438](https://github.com/dflook/terraform-github-actions/actions/runs/12449907040)